In [37]:
# Definition=
# As long as more than one columns of an exel sheet, then it is called data sheet

## Import

In [38]:
import numpy as np # numpy same as np
import pandas as pd # pandas same as pd

# Creating a Dataframe

In [39]:
mydata = np.random.randint(0,101,(4,3))#4x3||4 is row 3 is column
my_index = ['CA','NY','AZ','TX']
my_col = ['Jan','Feb','Mar'] # col is column for short
df=pd.DataFrame(data=mydata,index=my_index,columns=my_col)#df is dataframe
df

    Jan  Feb  Mar
CA   87   64   96
NY   66   53   76
AZ   37   55   97
TX   24   22   94

# Read .csv file

In [40]:
df = pd.read_csv('tips.csv')
df
# a smart display system that displays the first 5 and last 5 lines as some 
# files can have millions and could be way to long
# FOR COLUMNS there are 11 different features/data including the column is 12
# FOR ROWS not including title row is 244

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

### Assingment 1. import read .csv file(basketball file) 2. Explain a details of features everysingle one. 3. Comepeup with an idea of a description of the dataset(objective truth no sujective truth) 4. According to the basketball datasets... Propose a study on at least 2 topics you can research

In [41]:
# Read the NBA .csv File

In [42]:
# Explain the details of the features

## There are 25 head columns
# Column Descriptions
# Player: Name of the player.
#Tm: Abbreviation of the player's team.
#Opp: Abbreviation of the opposing team.
#Res: Result of the game for the player's team.
#MP: Minutes played, represented as a float (e.g., 23.5 = 23 minutes and 30 seconds).
#FG: Field goals made.
#FGA: Field goal attempts.
#FG%: Field goal percentage.
#3P: 3-point field goals made.
#3PA: 3-point field goal attempts.
#3P%: 3-point shooting percentage.
#FT: Free throws made.
#FTA: Free throw attempts.
#FT%: Free throw percentage.
#ORB: Offensive rebounds.
#DRB: Defensive rebounds.
#TRB: Total rebounds.
#AST: Assists.
#3STL: Steals.
#BLK: Blocks.
#TOV: Turnovers.
#PF: Personal fouls.
#PTS: Total points scored.
#GmSc: Game Score, a metric summarizing player performance for the game.
#Data: Date of the game in YYYY-MM-DD format.

In [43]:
# Write the description of the dataset (Objective truth)

# The dataset includes detailed performance stats for NBA players from the 2024–2025
# season. It covers both basic stats (like points and rebounds) and advanced
# metrics (such as efficiency ratings), making it perfect for analyzing how players
# are performing, comparing their stats, and spotting trends over the season.
# The data is on Every single player in the NBA during the 24-25 season.
# It’s good for looking into player performance analysis,
# track trends, or predict future outcomes.

In [44]:
# According to the study of our dataset, propose at least two topics that I can
#  research through our dataset.

#/// 1. First topic: The impact of minutes played on player efficentcy. So
# If one player has a great game say 30 pts and a triple double. How does that affect
# the next game they will play? Will they perform the same or perform significantly
# worse due to fatigue and how does that affect the teams win and loss count

#// Second topic:  Shooting efficentcy vs. Shot Volume
# This topic looks at whether players who take more shots still make them 
# at a high rate. It lools if shooting a lot makes a player less accurate, 
# or if some players can keep scoring well even with more attempts.

# DataFrames

## Obtaining Basic Information About DataFrame

In [45]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size',
       'price_per_person', 'Payer Name', 'CC Number', 'Payment ID'],
      dtype='object')

In [46]:
df.index

RangeIndex(start=0, stop=244, step=1)

In [47]:
df.head(3)#this will print the first numbers. On default without any numbers
#e.g.(3) it will print the first 5

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458

In [48]:
df.tail(3)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

In [49]:
len(df)  # This gives the number of rows

244

In [50]:
len(df.columns) # This prints the number of columns

11

# Selction and Indexing

In [51]:
# Grab a single column

### Grab a single column

In [52]:
df['total_bill']

0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64

In [53]:
df['sex']

0      Female
1        Male
2        Male
3        Male
4      Female
        ...
239      Male
240    Female
241      Male
242      Male
243    Female
Name: sex, Length: 244, dtype: object

In [54]:
df['total_bill'].head(9) # combines the two together

0    16.99
1    10.34
2    21.01
3    23.68
4    24.59
5    25.29
6     8.77
7    26.88
8    15.04
Name: total_bill, dtype: float64

In [55]:
type(df['total_bill'])

pandas.core.series.Series

### Grab Multiple Columns

In [56]:
# Note how its a python list of column names!  Thus the double brackets.
df[['total_bill','tip','sex']]

     total_bill   tip     sex
0         16.99  1.01  Female
1         10.34  1.66    Male
2         21.01  3.50    Male
3         23.68  3.31    Male
4         24.59  3.61  Female
..          ...   ...     ...
239       29.03  5.92    Male
240       27.18  2.00  Female
241       22.67  2.00    Male
242       17.82  1.75    Male
243       18.78  3.00  Female

[244 rows x 3 columns]

# Creating a New Feature

In [57]:
df['tip_percentage'] = 100

In [58]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tip_percentage
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,100
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,100
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,100
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,100
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,100

##

In [59]:
df['tip_percentage'] = 100* df['tip'] / df['total_bill']

In [60]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tip_percentage
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,5.944673
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,16.054159
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,16.658734
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,13.978041
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,14.680765

## Adjust Existing Column

In [61]:
df['price_per_person'] = np.round(df['price_per_person'],1)

In [62]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tip_percentage
0,16.99,1.01,Female,No,Sun,Dinner,2,8.5,Christy Cunningham,3560325168603410,Sun2959,5.944673
1,10.34,1.66,Male,No,Sun,Dinner,3,3.4,Douglas Tucker,4478071379779230,Sun4608,16.054159
2,21.01,3.50,Male,No,Sun,Dinner,3,7.0,Travis Walters,6011812112971322,Sun4458,16.658734
3,23.68,3.31,Male,No,Sun,Dinner,2,11.8,Nathaniel Harris,4676137647685994,Sun5260,13.978041
4,24.59,3.61,Female,No,Sun,Dinner,4,6.2,Tonya Carter,4832732618637221,Sun2251,14.680765

In [63]:
# df.drop('tip_percentage',axis=1)

In [64]:
df = df.drop("tip_percentage",axis=1)

In [65]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.5,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.4,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.0,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.8,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.2,Tonya Carter,4832732618637221,Sun2251

# Set Index

In [66]:
df.index

RangeIndex(start=0, stop=244, step=1)

In [67]:
df.set_index('Payment ID')

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
Payment ID,,,,,,,,,,
Sun2959,16.99,1.01,Female,No,Sun,Dinner,2,8.5,Christy Cunningham,3560325168603410
Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.4,Douglas Tucker,4478071379779230
Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.0,Travis Walters,6011812112971322
Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.8,Nathaniel Harris,4676137647685994
Sun2251,24.59,3.61,Female,No,Sun,Dinner,4,6.2,Tonya Carter,4832732618637221
...,...,...,...,...,...,...,...,...,...,...
Sat2657,29.03,5.92,Male,No,Sat,Dinner,3,9.7,Michael Avila,5296068606052842
Sat1766,27.18,2.00,Female,Yes,Sat,Dinner,2,13.6,Monica Sanders,3506806155565404
Sat3880,22.67,2.00,Male,Yes,Sat,Dinner,2,11.3,Keith Wong,6011891618747196
Sat17,17.82,1.75,Male,No,Sat,Dinner,2,8.9,Dennis Dixon,4375220550950
Thur672,18.78,3.00,Female,No,Thur,Dinner,2,9.4,Michelle Hardin,3511451626698139

# Reset Index

In [68]:
df = df.reset_index()

In [69]:
df.head()

,index,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,0,16.99,1.01,Female,No,Sun,Dinner,2,8.5,Christy Cunningham,3560325168603410,Sun2959
1,1,10.34,1.66,Male,No,Sun,Dinner,3,3.4,Douglas Tucker,4478071379779230,Sun4608
2,2,21.01,3.50,Male,No,Sun,Dinner,3,7.0,Travis Walters,6011812112971322,Sun4458
3,3,23.68,3.31,Male,No,Sun,Dinner,2,11.8,Nathaniel Harris,4676137647685994,Sun5260
4,4,24.59,3.61,Female,No,Sun,Dinner,4,6.2,Tonya Carter,4832732618637221,Sun2251

# Grab a Single Row

In [70]:
# Integer Based
df.iloc[0]

index                                0
total_bill                       16.99
tip                               1.01
sex                             Female
smoker                              No
day                                Sun
time                            Dinner
size                                 2
price_per_person                   8.5
Payer Name          Christy Cunningham
CC Number             3560325168603410
Payment ID                     Sun2959
Name: 0, dtype: object

# Grab Multiple Rows

In [71]:
df.iloc[0:4]

,index,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,0,16.99,1.01,Female,No,Sun,Dinner,2,8.5,Christy Cunningham,3560325168603410,Sun2959
1,1,10.34,1.66,Male,No,Sun,Dinner,3,3.4,Douglas Tucker,4478071379779230,Sun4608
2,2,21.01,3.50,Male,No,Sun,Dinner,3,7.0,Travis Walters,6011812112971322,Sun4458
3,3,23.68,3.31,Male,No,Sun,Dinner,2,11.8,Nathaniel Harris,4676137647685994,Sun5260

# Remove a Row

In [72]:
df.drop('Sun2959', axis=)

SyntaxError: invalid syntax (2943643725.py, line 1)

# Conditional Filter

## Single Condition

In [73]:
bool_series = df['tip'] > 5
bool_series

0      False
1      False
2      False
3      False
4      False
       ...
239     True
240    False
241    False
242    False
243    False
Name: tip, Length: 244, dtype: bool

In [74]:
df[bool_series]

,index,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
23,23,39.42,7.58,Male,No,Sat,Dinner,4,9.9,Lance Peterson,3542584061609808,Sat239
44,44,30.40,5.60,Male,No,Sun,Dinner,4,7.6,Todd Cooper,503846761263,Sun2274
47,47,32.40,6.00,Male,No,Sun,Dinner,4,8.1,James Barnes,3552002592874186,Sun9677
52,52,34.81,5.20,Female,No,Sun,Dinner,4,8.7,Emily Daniel,4291280793094374,Sun6165
59,59,48.27,6.73,Male,No,Sat,Dinner,4,12.1,Brian Ortiz,6596453823950595,Sat8139
85,85,34.83,5.17,Female,No,Thur,Lunch,4,8.7,Shawna Cook,6011787464177340,Thur7972
88,88,24.71,5.85,Male,No,Thur,Lunch,2,12.4,Roger Taylor,4410248629955,Thur9003
116,116,29.93,5.07,Male,No,Sun,Dinner,4,7.5,Shawn Blake,4689079711213722,Sun22
141,141,34.30,6.70,Male,No,Thur,Lunch,6,5.7,Steven Carlson,3526515703718508,Thur1025
155,155,29.85,5.14,Female,No,Sun,Dinner,5,6.0,Madison Wilson,4210875236164664,Sun9176
170,170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.9,Gregory Clark,5473850968388236,Sat1954
172,172,7.25,5.15,Male,Yes,Sun,Dinner,2,3.6,Larry White,30432617123103,Sun9209
181,181,23.33,5.65,Male,Yes,Sun,Dinner,2,11.7,Jason Cox,6556931703586223,Sun3402
183,183,23.17,6.50,Male,Yes,Sun,Dinner,4,5.8,Dr. Michael James,4718501859162,Sun6059
211,211,25.89,5.16,Male,Yes,Sat,Dinner,4,6.5,Christopher Li,6011962464150569,Sat6735
212,212,48.33,9.00,Male,No,Sat,Dinner,4,12.1,Alex Williamson,676218815212,Sat4590
214,214,28.17,6.50,Female,Yes,Sat,Dinner,3,9.4,Marissa Jackson,4922302538691962,Sat3374
239,239,29.03,5.92,Male,No,Sat,Dinner,3,9.7,Michael Avila,5296068606052842,Sat2657

In [75]:
df[df['tip'] > 5]

,index,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
23,23,39.42,7.58,Male,No,Sat,Dinner,4,9.9,Lance Peterson,3542584061609808,Sat239
44,44,30.40,5.60,Male,No,Sun,Dinner,4,7.6,Todd Cooper,503846761263,Sun2274
47,47,32.40,6.00,Male,No,Sun,Dinner,4,8.1,James Barnes,3552002592874186,Sun9677
52,52,34.81,5.20,Female,No,Sun,Dinner,4,8.7,Emily Daniel,4291280793094374,Sun6165
59,59,48.27,6.73,Male,No,Sat,Dinner,4,12.1,Brian Ortiz,6596453823950595,Sat8139
85,85,34.83,5.17,Female,No,Thur,Lunch,4,8.7,Shawna Cook,6011787464177340,Thur7972
88,88,24.71,5.85,Male,No,Thur,Lunch,2,12.4,Roger Taylor,4410248629955,Thur9003
116,116,29.93,5.07,Male,No,Sun,Dinner,4,7.5,Shawn Blake,4689079711213722,Sun22
141,141,34.30,6.70,Male,No,Thur,Lunch,6,5.7,Steven Carlson,3526515703718508,Thur1025
155,155,29.85,5.14,Female,No,Sun,Dinner,5,6.0,Madison Wilson,4210875236164664,Sun9176
170,170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.9,Gregory Clark,5473850968388236,Sat1954
172,172,7.25,5.15,Male,Yes,Sun,Dinner,2,3.6,Larry White,30432617123103,Sun9209
181,181,23.33,5.65,Male,Yes,Sun,Dinner,2,11.7,Jason Cox,6556931703586223,Sun3402
183,183,23.17,6.50,Male,Yes,Sun,Dinner,4,5.8,Dr. Michael James,4718501859162,Sun6059
211,211,25.89,5.16,Male,Yes,Sat,Dinner,4,6.5,Christopher Li,6011962464150569,Sat6735
212,212,48.33,9.00,Male,No,Sat,Dinner,4,12.1,Alex Williamson,676218815212,Sat4590
214,214,28.17,6.50,Female,Yes,Sat,Dinner,3,9.4,Marissa Jackson,4922302538691962,Sat3374
239,239,29.03,5.92,Male,No,Sat,Dinner,3,9.7,Michael Avila,5296068606052842,Sat2657

In [76]:
df[df['sex'] == 'Male']

,index,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
1,1,10.34,1.66,Male,No,Sun,Dinner,3,3.4,Douglas Tucker,4478071379779230,Sun4608
2,2,21.01,3.50,Male,No,Sun,Dinner,3,7.0,Travis Walters,6011812112971322,Sun4458
3,3,23.68,3.31,Male,No,Sun,Dinner,2,11.8,Nathaniel Harris,4676137647685994,Sun5260
5,5,25.29,4.71,Male,No,Sun,Dinner,4,6.3,Erik Smith,213140353657882,Sun9679
6,6,8.77,2.00,Male,No,Sun,Dinner,2,4.4,Kristopher Johnson,2223727524230344,Sun5985
...,...,...,...,...,...,...,...,...,...,...,...,...
236,236,12.60,1.00,Male,Yes,Sat,Dinner,2,6.3,Matthew Myers,3543676378973965,Sat5032
237,237,32.83,1.17,Male,Yes,Sat,Dinner,2,16.4,Thomas Brown,4284722681265508,Sat2929
239,239,29.03,5.92,Male,No,Sat,Dinner,3,9.7,Michael Avila,5296068606052842,Sat2657
241,241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.3,Keith Wong,6011891618747196,Sat3880
242,242,17.82,1.75,Male,No,Sat,Dinner,2,8.9,Dennis Dixon,4375220550950,Sat17

# Multiple-Condition

In [78]:
df[(df['total_bill'] > 30) & (df["sex"]=='Male')]

,index,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
23,23,39.42,7.58,Male,No,Sat,Dinner,4,9.9,Lance Peterson,3542584061609808,Sat239
39,39,31.27,5.00,Male,No,Sat,Dinner,3,10.4,Mr. Brandon Berry,6011525851069856,Sat6373
44,44,30.40,5.60,Male,No,Sun,Dinner,4,7.6,Todd Cooper,503846761263,Sun2274
47,47,32.40,6.00,Male,No,Sun,Dinner,4,8.1,James Barnes,3552002592874186,Sun9677
56,56,38.01,3.00,Male,Yes,Sat,Dinner,4,9.5,James Christensen DDS,349793629453226,Sat8903
59,59,48.27,6.73,Male,No,Sat,Dinner,4,12.1,Brian Ortiz,6596453823950595,Sat8139
83,83,32.68,5.00,Male,Yes,Thur,Lunch,2,16.3,Daniel Murphy,5356177501009133,Thur8801
95,95,40.17,4.73,Male,Yes,Fri,Dinner,4,10.0,Aaron Bentley,180026611638690,Fri9628
112,112,38.07,4.00,Male,No,Sun,Dinner,3,12.7,Jeff Lopez,3572865915176463,Sun591
141,141,34.30,6.70,Male,No,Thur,Lunch,6,5.7,Steven Carlson,3526515703718508,Thur1025
142,142,41.19,5.00,Male,No,Thur,Lunch,5,8.2,Eric Andrews,4356531761046453,Thur3621
156,156,48.17,5.00,Male,No,Sun,Dinner,6,8.0,Ryan Gonzales,3523151482063321,Sun7518
167,167,31.71,4.50,Male,No,Sun,Dinner,4,7.9,Michael Lawson,3566285921227119,Sun3719
170,170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.9,Gregory Clark,5473850968388236,Sat1954
173,173,31.85,3.18,Male,Yes,Sun,Dinner,2,15.9,Scott Perez,3577115550328507,Sun9335
175,175,32.90,3.11,Male,Yes,Sun,Dinner,2,16.4,Nathan Reynolds,370307040837149,Sun5109
179,179,34.63,3.55,Male,Yes,Sun,Dinner,2,17.3,Brian Bailey,346656312114848,Sun9851
180,180,34.65,3.68,Male,Yes,Sun,Dinner,4,8.7,James Hebert DDS,676168737648,Sun7544
182,182,45.35,3.50,Male,Yes,Sun,Dinner,3,15.1,Jose Parsons,4112207559459910,Sun2337
184,184,40.55,3.00,Male,Yes,Sun,Dinner,2,20.3,Stephen Cox,3547798222044029,Sun5140
187,187,30.46,2.00,Male,Yes,Sun,Dinner,5,6.1,David Barrett,4792882899700988,Sun9987
207,207,38.73,3.00,Male,Yes,Sat,Dinner,4,9.7,Ricky Ramirez,347817964484033,Sat4505
210,210,30.06,2.00,Male,Yes,Sat,Dinner,3,10.0,Shawn Mendoza,30184049218122,Sat8361
212,212,48.33,9.00,Male,No,Sat,Dinner,4,12.1,Alex Williamson,676218815212,Sat4590
237,237,32.83,1.17,Male,Yes,Sat,Dinner,2,16.4,Thomas Brown,4284722681265508,Sat2929

In [80]:
df[(df['day']=='Sun') | (df['day']=='Sat')]

,index,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,0,16.99,1.01,Female,No,Sun,Dinner,2,8.5,Christy Cunningham,3560325168603410,Sun2959
1,1,10.34,1.66,Male,No,Sun,Dinner,3,3.4,Douglas Tucker,4478071379779230,Sun4608
2,2,21.01,3.50,Male,No,Sun,Dinner,3,7.0,Travis Walters,6011812112971322,Sun4458
3,3,23.68,3.31,Male,No,Sun,Dinner,2,11.8,Nathaniel Harris,4676137647685994,Sun5260
4,4,24.59,3.61,Female,No,Sun,Dinner,4,6.2,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...,...
238,238,35.83,4.67,Female,No,Sat,Dinner,3,11.9,Kimberly Crane,676184013727,Sat9777
239,239,29.03,5.92,Male,No,Sat,Dinner,3,9.7,Michael Avila,5296068606052842,Sat2657
240,240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.6,Monica Sanders,3506806155565404,Sat1766
241,241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.3,Keith Wong,6011891618747196,Sat3880
242,242,17.82,1.75,Male,No,Sat,Dinner,2,8.9,Dennis Dixon,4375220550950,Sat17